ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/SVD/HC32F448KCTI.svd
                <register>
                    <name>TXBCR</name>
                    <description>desc TXBCR</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CR0</name>
                            <description>desc CR0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR1</name>
                            <description>desc CR1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR2</name>
                            <description>desc CR2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR3</name>
                            <description>desc CR3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR4</name>
                            <description>desc CR4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR5</name>
                            <description>desc CR5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR6</name>
                            <description>desc CR6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR7</name>
                            <description>desc CR7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR8</name>
                            <description>desc CR8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR9</name>
                            <description>desc CR9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR10</name>
                            <description>desc CR10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR11</name>
                            <description>desc CR11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR12</name>
                            <description>desc CR12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR13</name>
                            <description>desc CR13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR14</name>
                            <description>desc CR14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR15</name>
                            <description>desc CR15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR16</name>
                            <description>desc CR16</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR17</name>
                            <description>desc CR17</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR18</name>
                            <description>desc CR18</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR19</name>
                            <description>desc CR19</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR20</name>
                            <description>desc CR20</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR21</name>
                            <description>desc CR21</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR22</name>
                            <description>desc CR22</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR23</name>
                            <description>desc CR23</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR24</name>
                            <description>desc CR24</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR25</name>
                            <description>desc CR25</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR26</name>
                            <description>desc CR26</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR27</name>
                            <description>desc CR27</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR28</name>
                            <description>desc CR28</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR29</name>
                            <description>desc CR29</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR30</name>
                            <description>desc CR30</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CR31</name>
                            <description>desc CR31</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXBTO</name>
                    <description>desc TXBTO</description>
                    <addressOffset>0xD8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TO0</name>
                            <description>desc TO0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO1</name>
                            <description>desc TO1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO2</name>
                            <description>desc TO2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO3</name>
                            <description>desc TO3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO4</name>
                            <description>desc TO4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO5</name>
                            <description>desc TO5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO6</name>
                            <description>desc TO6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO7</name>
                            <description>desc TO7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO8</name>
                            <description>desc TO8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO9</name>
                            <description>desc TO9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO10</name>
                            <description>desc TO10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO11</name>
                            <description>desc TO11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO12</name>
                            <description>desc TO12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO13</name>
                            <description>desc TO13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO14</name>
                            <description>desc TO14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO15</name>
                            <description>desc TO15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO16</name>
                            <description>desc TO16</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO17</name>
                            <description>desc TO17</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO18</name>
                            <description>desc TO18</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO19</name>
                            <description>desc TO19</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO20</name>
                            <description>desc TO20</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO21</name>
                            <description>desc TO21</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO22</name>
                            <description>desc TO22</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO23</name>
                            <description>desc TO23</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO24</name>
                            <description>desc TO24</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO25</name>
                            <description>desc TO25</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO26</name>
                            <description>desc TO26</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO27</name>
                            <description>desc TO27</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO28</name>
                            <description>desc TO28</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO29</name>
                            <description>desc TO29</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO30</name>
                            <description>desc TO30</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TO31</name>
                            <description>desc TO31</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
